vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.TMPM4_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>TMPM4_DFP</name>
  <description>Toshiba TX04 Series Device Support</description>

  <releases>
    <release version="1.2.1" date="2023-09-04" deprecated="2023-09-04">
      This Software Pack is no longer maintained. Please contact the device vendor for support.
	</release>
    <release version="1.2.0" date="2015-04-17">
      - Added TMPM470, TMPM475 and TMPM46B device support.
      - Added new device data sheets.
      - Renamed Flash Algorithms (keeping old FLM files for backward compatibility).
    </release>
    <release version="1.1.0" date="2015-01-22">
      - Added TMPM411F20XBG Device Support
      - fixed TMPM46x_1024.FLM Flash Programming Algorithm timeout
    </release>
    <release version="1.0.0">
      First Release version of TX04 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Toshiba</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Toshiba</keyword>
    <keyword>TMPM4</keyword>
    <keyword>TX04</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="TX04 Series" Dvendor="Toshiba:92">
      <book name="Documents\dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <description>
The ARM Cortex-M4F core-based TX04 Series supports the Thumb-2 and Thumb instruction sets and
provides DSP extensions and a floating-point unit (FPU) in order to deliver high energy efficiency.
The TX04 Series includes microcontrollers that also integrate a selection of peripheral circuits
such as high-speed NANO FLASH-100 (M440 Group) and high-performance coprocessors,
making them ideal for high-speed data processing.
      </description>


      <!-- ************************  Subfamily 'M410'  **************************** -->
      <subFamily DsubFamily="M410">
        <processor Pname="unitA" Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="80000000"/>
        <processor Pname="unitB" Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="80000000"/>
        <!-- book name="Documents\??.pdf" title="M410 User Manual"/-->

        <!-- *************************  Device 'TMPM411F20XBG'  ***************************** -->
        <device Dname="TMPM411F20XBG">
          <!--processor Dclock="80000000"/-->
          <compile   Pname="unitA" header="Device\Include\TMPM411_unitA.h"  define="TMPM411F20XBG"/>
          <debug     Pname="unitA" svd="SVD\M411_unitA.svd"/>
          <memory    Pname="unitA" id="IROM1"                     start="0x00000000" size="0x80000"  startup="1" default="1"/>
          <memory    Pname="unitA" id="IRAM1"                     start="0x20000000" size="0x8000"   init   ="0" default="1"/>
          <memory    Pname="unitA" id="IRAM2"                     start="0x20008000" size="0x800"    init   ="0" default="0"/>
          <algorithm Pname="unitA" name="Flash\TMPM41xA_512.FLM"  start="0x00000000" size="0x80000"              default="1"/>

          <feature Pname="unitA" type="DMA"           n="16"/>
          <feature Pname="unitA" type="IOs"           n="50"/>
          <feature Pname="unitA" type="Timer"         n="3"       m="16"       name="16-bit timer (interval timer mode, event counter mode, PPG output)"/>
          <feature Pname="unitA" type="Timer"         n="2"       m="16"       name="16-bit timer (Compare interrupt, rectangular wave output)"/>
          <feature Pname="unitA" type="RTC"           n="1"       m="32768"/>
          <feature Pname="unitA" type="WDT"           n="1"/>
          <feature Pname="unitA" type="UART"          n="2"                    name="UART/SIO"/>
          <feature Pname="unitA" type="UART"          n="1"                    name="Full UART"/>
          <feature Pname="unitA" type="I2C"           n="1"/>
          <feature Pname="unitA" type="ComOther"      n="3"                    name="Enhanced Serial I/O (SPI, SS, Microwire)"/>
          <feature Pname="unitA" type="ADC"           n="4"       m="12"/>
          <feature Pname="unitA" type="Other"         n="1"                    name="LCD driver"/>


          <compile   Pname="unitB" header="Device\Include\TMPM411_unitB.h"  define="TMPM411F20XBG"/>
          <debug     Pname="unitB" svd="SVD\M411_unitB.svd"/>
          <memory    Pname="unitB" id="IROM1"                     start="0x00000000" size="0x180000" startup="1" default="1"/>
          <memory    Pname="unitB" id="IRAM1"                     start="0x20000000" size="0x40000"  init   ="0" default="1"/>
          <algorithm Pname="unitB" name="Flash\TMPM41xB_1536.FLM" start="0x00000000" size="0x180000"             default="1"/>

          <feature Pname="unitB" type="DMA"           n="18"/>
          <feature Pname="unitB" type="IOs"           n="43"/>
          <feature Pname="unitB" type="Timer"         n="2"       m="16"       name="16-bit timer (interval timer mode, event counter mode, PPG output)"/>
          <feature Pname="unitB" type="Timer"         n="2"       m="16"       name="16-bit timer (Compare interrupt, rectangular wave output)"/>
          <feature Pname="unitB" type="WDT"           n="1"/>
          <feature Pname="unitB" type="UART"          n="4"                    name="UART/SIO"/>
          <feature Pname="unitB" type="UART"          n="1"                    name="Full UART"/>
          <feature Pname="unitB" type="ComOther"      n="1"                    name="Enhanced Serial I/O (SPI, SS, Microwire)"/>
          <feature Pname="unitB" type="ADC"           n="5"       m="12"/>
          <feature Pname="unitB" type="Other"         n="1"                    name="AES processor"/>
          <feature Pname="unitB" type="Other"         n="1"                    name="Secure hash processor"/>
          <feature Pname="unitB" type="Other"         n="1"                    name="Entropy seed generator"/>
          <feature Pname="unitB" type="Other"         n="1"                    name="Multiple length arithmetic coprocessor"/>

          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="193"/>
        </device>
      </subFamily>

