vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.TMPM4_DFP.pdsc
          <feature type="ExtBus"        n="16"                          name="External Bus Interface for SRAM Communication"/>
          <feature type="UART"          n="2"                           name="Full UART"/>
          <feature type="I2C"           n="5"/>
          <feature type="ComOther"      n="3"                           name="Synchronous Serial interface"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="2"       m="16"              name="Multi Purpose Timer"/>
          <feature type="Other"         n="1"                           name="Remote Control Signal Preprocessor"/>
          <feature type="UART"          n="6"                           name="UART/SIO"/>
          <feature type="IOs"           n="111"/>
          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'TMPM462F10FG'  ***************************** -->
        <device Dname="TMPM462F10FG">
          <processor Dclock="120000000"/>
          <book  name="Documents\TMPM462F10FG_datasheet_en_20141110.pdf"  title="TMPM462F15/F10FG Data Sheet"/>
          <compile header="Device\Include\TMPM462.h"  define="TMPM462F10FG"/>
          <debug svd="SVD\M462.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20030000"  size="0x00400"    init   ="0"   default="0"/>
          <algorithm  name="Flash\TMPM462_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="ExtBus"        n="16"                          name="External Bus Interface for SRAM Communication"/>
          <feature type="UART"          n="2"                           name="Full UART"/>
          <feature type="I2C"           n="5"/>
          <feature type="ComOther"      n="3"                           name="Synchronous Serial interface"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="2"       m="16"              name="Multi Purpose Timer"/>
          <feature type="Other"         n="1"                           name="Remote Control Signal Preprocessor"/>
          <feature type="UART"          n="10"                          name="UART/SIO"/>
          <feature type="IOs"           n="139"/>
          <feature type="QFP"           n="176"/>
        </device>

        <!-- *************************  Device 'TMPM462F15FG'  ***************************** -->
        <device Dname="TMPM462F15FG">
          <processor Dclock="120000000"/>
          <book  name="Documents\TMPM462F10FG_datasheet_en_20141110.pdf"  title="TMPM462F15/F10FG Data Sheet"/>
          <compile header="Device\Include\TMPM462.h"  define="TMPM462F15FG"/>
          <debug svd="SVD\M462.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20030000"  size="0x00400"    init   ="0"   default="0"/>
          <algorithm  name="Flash\TMPM462_1536.FLM"   start="0x00000000"  size="0x180000"                 default="1"/>

          <feature type="ExtBus"        n="16"                          name="External Bus Interface for SRAM Communication"/>
          <feature type="UART"          n="2"                           name="Full UART"/>
          <feature type="I2C"           n="5"/>
          <feature type="ComOther"      n="3"                           name="Synchronous Serial interface"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="2"       m="16"              name="Multi Purpose Timer"/>
          <feature type="Other"         n="1"                           name="Remote Control Signal Preprocessor"/>
          <feature type="UART"          n="10"                          name="UART/SIO"/>
          <feature type="IOs"           n="139"/>
          <feature type="QFP"           n="176"/>
        </device>

        <!-- *************************  Device 'TMPM462F10XBG'  **************************** -->
        <device Dname="TMPM462F10XBG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM462.h"  define="TMPM462F10XBG"/>
          <debug svd="SVD\M462.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20030000"  size="0x00400"    init   ="0"   default="0"/>
          <algorithm  name="Flash\TMPM462_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="ExtBus"        n="16"                          name="External Bus Interface for SRAM Communication"/>
          <feature type="UART"          n="2"                           name="Full UART"/>
          <feature type="I2C"           n="5"/>
          <feature type="ComOther"      n="3"                           name="Synchronous Serial interface"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="2"       m="16"              name="Multi Purpose Timer"/>
          <feature type="Other"         n="1"                           name="Remote Control Signal Preprocessor"/>
          <feature type="UART"          n="10"                          name="UART/SIO"/>
          <feature type="IOs"           n="139"/>
          <feature type="BGA"           n="189"/>
        </device>

