vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.TMPM4_DFP.pdsc
        <!-- *************************  Device 'TMPM462F15XBG'  **************************** -->
        <device Dname="TMPM462F15XBG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM462.h"  define="TMPM462F15XBG"/>
          <debug svd="SVD\M462.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20030000"  size="0x00400"    init   ="0"   default="0"/>
          <algorithm  name="Flash\TMPM462_1536.FLM"   start="0x00000000"  size="0x180000"                 default="1"/>

          <feature type="ExtBus"        n="16"                          name="External Bus Interface for SRAM Communication"/>
          <feature type="UART"          n="2"                           name="Full UART"/>
          <feature type="I2C"           n="5"/>
          <feature type="ComOther"      n="3"                           name="Synchronous Serial interface"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="2"       m="16"              name="Multi Purpose Timer"/>
          <feature type="Other"         n="1"                           name="Remote Control Signal Preprocessor"/>
          <feature type="UART"          n="10"                          name="UART/SIO"/>
          <feature type="IOs"           n="139"/>
          <feature type="BGA"           n="189"/>
        </device>

        <!-- *************************  Device 'TMPM46BF10FG'  **************************** -->
        <device Dname="TMPM46BF10FG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM46B.h"  define="TMPM46BF10FG"/>
          <debug svd="SVD\M46B.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x80000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20080000"  size="0x00800"    init   ="0"   default="0"/>
          <algorithm  name="Flash\TMPM46B_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="ExtBus"        n="16"                   name="External Bus Interface"/>
          <feature type="Other"         n="1"                    name="SLC NAND flash Controller"/>
          <feature type="Other"         n="1"                    name="AES processor"/>
          <feature type="Other"         n="1"                    name="Secure hash processor"/>
          <feature type="Other"         n="1"                    name="Entropy seed generator"/>
          <feature type="Other"         n="1"                    name="Multiple length arithmetic coprocessor"/>
          <feature type="IOs"           n="72"/>
          <feature type="Timer"         n="8"       m="16"       name="16-bit timer (interval timer mode, event counter mode, PPG output)"/>
          <feature type="Timer"         n="4"       m="16"       name="Multi Purpose Timer"/>
          <feature type="UART"          n="4"                    name="UART/SIO"/>
          <feature type="UART"          n="2"                    name="Full UART"/>
          <feature type="I2C"           n="3"/>
          <feature type="ComOther"      n="3"                    name="Synchronous Serial interface"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="Other"         n="1"                    name="Low Voltage detection"/>
          <feature type="QFP"           n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'M470'  **************************** -->
      <subFamily DsubFamily="M470">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
        <!-- book name="Documents\??.pdf" title="M460 User Manual"/-->

        <feature type="DMA"           n="32"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="VCC"           n="4.50"    m="5.50"/>
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- *************************  Device 'TMPM470FYFG'  **************************** -->
        <device Dname="TMPM470FYFG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM470.h"  define="TMPM470FYFG"/>
          <debug svd="SVD\M470.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1"   default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20008000" size="0x00000800" init   ="0"   default="0"/>
          <algorithm name="Flash\TMPM470_256.FLM" start="0x00000000" size="0x00040000"               default="1"/>

          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="IOs"           n="79"/>
          <feature type="QFP"           n="100"                         name="LQFP package"/>
        </device>

        <!-- *************************  Device 'TMPM470FZFG'  **************************** -->
        <device Dname="TMPM470FZFG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM470.h"  define="TMPM470FZFG"/>
          <debug svd="SVD\M470.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00060000" startup="1"   default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20008000" size="0x00000800" init   ="0"   default="0"/>
          <algorithm name="Flash\TMPM470_384.FLM" start="0x00000000" size="0x00060000"               default="1"/>

          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="IOs"           n="79"/>
          <feature type="QFP"           n="100"                         name="LQFP package"/>
        </device>

