vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.TMPM4_DFP.pdsc
        <!-- *************************  Device 'TMPM470FDFG'  **************************** -->
        <device Dname="TMPM470FDFG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM470.h"  define="TMPM470FDFG"/>
          <debug svd="SVD\M470.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1"   default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20008000" size="0x00000800" init   ="0"   default="0"/>
          <algorithm name="Flash\TMPM470_512.FLM" start="0x00000000" size="0x00080000"               default="1"/>

          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="IOs"           n="79"/>
          <feature type="QFP"           n="100"                         name="LQFP package"/>
        </device>

        <!-- *************************  Device 'TMPM475FYFG'  **************************** -->
        <device Dname="TMPM475FYFG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM475.h"  define="TMPM475FYFG"/>
          <debug svd="SVD\M475.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1"   default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20008000" size="0x00000800" init   ="0"   default="0"/>
          <algorithm name="Flash\TMPM470_256.FLM" start="0x00000000" size="0x00040000"               default="1"/>

          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="CAN"           n="1"                           name="CAN controller"/>
          <feature type="IOs"           n="79"/>
          <feature type="QFP"           n="100"                         name="LQFP package"/>
        </device>

        <!-- *************************  Device 'TMPM475FZFG'  **************************** -->
        <device Dname="TMPM475FZFG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM475.h"  define="TMPM475FZFG"/>
          <debug svd="SVD\M475.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00060000" startup="1"   default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20008000" size="0x00000800" init   ="0"   default="0"/>
          <algorithm name="Flash\TMPM470_384.FLM" start="0x00000000" size="0x00060000"               default="1"/>

          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="CAN"           n="1"                           name="CAN controller"/>
          <feature type="IOs"           n="79"/>
          <feature type="QFP"           n="100"                         name="LQFP package"/>
        </device>

        <!-- *************************  Device 'TMPM475FDFG'  **************************** -->
        <device Dname="TMPM475FDFG">
          <processor Dclock="120000000"/>
          <compile header="Device\Include\TMPM475.h"  define="TMPM475FDFG"/>
          <debug svd="SVD\M475.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1"   default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20008000" size="0x00000800" init   ="0"   default="0"/>
          <algorithm name="Flash\TMPM470_512.FLM" start="0x00000000" size="0x00080000"               default="1"/>

          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="CAN"           n="1"                           name="CAN controller"/>
          <feature type="IOs"           n="79"/>
          <feature type="QFP"           n="100"                         name="LQFP package"/>
        </device>
      </subFamily>

    </family>
  </devices>


  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM411_unitA CMSIS">
      <description>Toshiba TMPM411 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM411*" Pname="unitA"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM411_unitB CMSIS">
      <description>Toshiba TMPM411 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM411*" Pname="unitB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM440 CMSIS">
      <description>Toshiba TMPM440 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM440*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM461 CMSIS">
      <description>Toshiba TMPM461 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM461*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM462 CMSIS">
      <description>Toshiba TMPM462 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM462*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

